Revit 2026 API

# RebarConstraintGetTargetRebarEdgeNumber Method

---

Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge'. Rebar must be Shape Driven Rebar element.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetTargetRebarEdgeNumber()
```
```vb
Public Function GetTargetRebarEdgeNumber As Integer
```
```cpp
public:
int GetTargetRebarEdgeNumber()
```
```fsharp
member GetTargetRebarEdgeNumber : unit -> int
```

#### Return Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarConstraint is not attached to an edge, or bend, or hook bend of another Rebar Element. -or- Constrained rebar isn't a shape driven rebar element. |

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace